#lang racket

(define (abs x)
	(cond ((< x 0) (- x))
		(else x)))

(define (cube x) (* x x x))
(define (p x) (- (* 3 x) (* 4 (cube x))))

(define (sine angle)
	(if (not (> (abs angle) 0.1))
		angle
		(p (sine (/ angle 3.0)))))

(sine 12.15)

#|
12.15 / 3 
4.05 / 3
1.35 / 3
0.45 / 3
0.15 / 3
0.05

p 0.05
3*0.05 0.15
0.000125

p 0.1495
0.4485 - 0.3608671365 = 0.0876328635

p 0.0876328635
0.2628985905 - 0.0026919128787 = 0.2602066776213

p 0.2602066776213
0.7806200328639 - 0.0704717901945 = 0.7101482426693

p 0.7101482426693

a. 5回
b.	増加オーダー,θ(a)
	空間オーダー,θ(a)

// answer
b.	sineは末尾再帰的なので, 空間オーダーはΘ(1)
	ステップはaが3倍になると1回増えるので, Θ(log3a)
|#